#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
	cout << "ПРИКОЛЫ ОТ ПРОГРАММИСТОВ"<< "\n" << "\n";

	cout << "— Вчера долго пыталась объяснить бабуле, что работаю программистом " << "\n" << "— Удалось?" << "\n" << "— Короче, сошлись на том, что чиню телевизоры и развожу мышей " << "\n";

	cout << "\n" << "\n";

	cout << "Один программист узнает у другого :" << "\n" << " — Ты на какое печатное издание подписался ?" << "\n" << " — А для чего мне издание, если имеется Интернет ?" << "\n" << " — А в санузел с клавиатурой ходить будешь ?" << "\n";

	cout << "\n" << "\n";

	cout << "Программиста спрашивают:" << "\n" << "- Как вам удалось так быстро выучить английский язык ?!" << "\n" << "- Та,ерунда какая.Они там почти все слова из С++ взяли." << "\n";

	cout << "\n" << "\n";

	cout << "Разговор двух программистов :" << "\n" << "-Вчера вот новую " << "мамку" << " притащил.Всю ночь протрахался!!!!" << "\n" << "- И что ? ? ? ? ? ?" << "\n" << "-Да не встает зараза!!!!!" << "\n";
	
		 
	return 0;
}